/*
  คำสั่ง Mission

  P(100);             เดินหน้าจนเจอเส้น
  PT(100,1000);       เดินหน้าตามเวลา
  B(100);            ถอยหลังจนเจอเส้น
  BT(100,1000);      ถอยหลังตามเวลา
  L(100);             เลี้ยวซ้าย
  R(100);             เลี้ยวขวา
*/

// ชดเชยความเร็วมอเตอร์ซ้าย/ขวา
// ค่าบวก = เพิ่ม PWM ให้ล้อนั้น
int speed_L = 0;
int speed_R = 0;

void menu1()
{
  servo(); // เปลี่ยนขา Servo ได้ที่นี่
}

void menu2()
{
  L(100);
}

void menu3()
{
  R(100);
}

void menu4()
{
  P(100);
  R(100);
  P(100);
}

